# -*- coding: utf-8 -*-
# -*- mode: org -*-

#+Title: Projeto de Compilador: Etapa 1 de *Análise Léxica*
#+Author: Prof. Lucas Mello Schnorr (INF/UFRGS)
#+Date: schnorr@inf.ufrgs.br

#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [10pt, twocolumn, a4paper]
#+LATEX_HEADER: \input{org-babel.tex}

#+OPTIONS: toc:nil
#+STARTUP: overview indent
#+TAGS: Lucas(L) noexport(n) deprecated(d)
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

A primeira etapa consiste em fazer um analisador léxico utilizando a
ferramenta de geração de reconhecedores =flex=. Tu deves manter o
arquivo =tokens.h= (fornecido) sem modificações. A função principal deve
estar em um arquivo =main.c= separado do arquivo =scanner.l=. Isso é
necessário para facilitar os testes automáticos, que utilizará uma
função principal especial escrita pelo professor (muito parecida com a
fornecida em anexo), substituindo a que você escreveu para testes e
desenvolvimento. Tu deves usar essa estrutura de organização, mantendo
os nomes de arquivo =tokens.h= e =scanner.l=.

Instruções mais detalhadas sobre o formato de submissão e cuidados com
detalhes específicos estão na especificação geral.

* 2016-05-21 Gerador de tokens para testes                         :noexport:

Tokens desta especificação:

#+begin_src txt :tangle tokens.input
//palavras reservadas
TK_PR_INT int
TK_PR_FLOAT float
TK_PR_BOOL bool
TK_PR_CHAR char
TK_PR_STRING string
TK_PR_IF if
TK_PR_THEN then
TK_PR_ELSE else
TK_PR_WHILE while
TK_PR_DO do
TK_PR_INPUT input
TK_PR_OUTPUT output
TK_PR_RETURN return
TK_PR_CONST const
TK_PR_STATIC static
TK_PR_FOREACH foreach
TK_PR_FOR for
TK_PR_SWITCH switch
TK_PR_CASE case
TK_PR_BREAK break
TK_PR_CONTINUE continue
TK_PR_CLASS class
TK_PR_PRIVATE private
TK_PR_PUBLIC public
TK_PR_PROTECTED protected
//caracteres especiais
TK_ESPECIAL ,
TK_ESPECIAL ;
TK_ESPECIAL :
TK_ESPECIAL (
TK_ESPECIAL ) 
TK_ESPECIAL [
TK_ESPECIAL ]
TK_ESPECIAL {
TK_ESPECIAL }
TK_ESPECIAL +
TK_ESPECIAL - 
TK_ESPECIAL *
TK_ESPECIAL /
TK_ESPECIAL <
TK_ESPECIAL >
TK_ESPECIAL =
TK_ESPECIAL !
TK_ESPECIAL &
TK_ESPECIAL $
TK_ESPECIAL %
TK_ESPECIAL #
TK_ESPECIAL ^
//operadores compostos
TK_OC_LE <=
TK_OC_GE >=
TK_OC_EQ ==
TK_OC_NE !=
TK_OC_AND &&
TK_OC_OR ||
TK_OC_SR >>
TK_OC_SL <<
//identificadores
TK_IDENTIFICADOR id
TK_IDENTIFICADOR ID
TK_IDENTIFICADOR _id
TK_IDENTIFICADOR _ID
TK_IDENTIFICADOR _01
//literais
TK_LIT_INT 12
TK_LIT_INT -12
TK_LIT_INT +12
TK_LIT_FLOAT 12.34
TK_LIT_FLOAT -12.34
TK_LIT_FLOAT +12.34
TK_LIT_FALSE false
TK_LIT_TRUE true
TK_LIT_CHAR 'a'
TK_LIT_CHAR '='
TK_LIT_CHAR '+'
TK_LIT_STRING "meu nome"
TK_LIT_STRING "x = 3"
#+end_src

Extras:

#+begin_src txt :tangle extra_00.input
12
 //34  56
78
INF47: 1 TK_LIT_INT [12]
INF47: 3 TK_LIT_INT [78]
INF47TABLE: [12] 1
INF47TABLE: [78] 3
#+end_src

#+begin_src txt :tangle extra_01.input
12 /*
   34  56
*/78
INF47: 1 TK_LIT_INT [12]
INF47: 3 TK_LIT_INT [78]
INF47TABLE: [12] 1
INF47TABLE: [78] 3
#+end_src

#+begin_src txt :tangle extra_02.input
id12
34
56.78
INF47: 1 TK_IDENTIFICADOR [id12]
INF47: 2 TK_LIT_INT [34]
INF47: 3 TK_LIT_FLOAT [56.78]
INF47TABLE: [id12] 1
INF47TABLE: [34] 2
INF47TABLE: [56.78] 3
#+end_src

Gerador de testes para esta especificação:

#+begin_src sh :results output :session :exports both
sed "/^\/\/.*/d" tokens.input > tokens_aux.input
CONTADOR=1
DIR=saida
mkdir -p $DIR
rm -rf $DIR/*
while read -r line; do
  #unique identifier
  TOKEN=`echo "$line" | cut -d" " -f2-`
  TIPO=`echo "$line" | cut -d" " -f1`

  UNIQUE=$(echo 00000$CONTADOR | tail -c 4)
  ENTRADATEST="entrada_$UNIQUE"
  ENTRADA="$DIR/$ENTRADATEST"
  TESH="$DIR/aval_$UNIQUE.tesh"
  TESHV="$DIR/valg_$UNIQUE.tesh"

  #generate input
  echo "$TOKEN" > $ENTRADA

  #generate tesh
  echo "#! ./tesh" > $TESH
  echo "! timeout 5" >> $TESH
  echo "$ ./main tests/e1/$ENTRADATEST" >> $TESH
  echo "> 1 $TIPO [$TOKEN]" >> $TESH
  #the following four lines do not work
  #echo "! setenv INF47_TABLE=True" >> $TESH
  #echo "$ ./main tests/e1/$ENTRADATEST" >> $TESH
  #TK=`echo "$TOKEN" | sed "s/\"//g"`
  #echo "> Etapa 1 Tabela: $TK 1" >> $TESH

  #generate tesh for valgrind
  echo "#! ./tesh" > $TESHV
  echo "! timeout 15" >> $TESHV
  echo "! output ignore" >> $TESHV
  echo "$ ./tests/scripts/valgrindtest ./main tests/e1/$ENTRADATEST" >> $TESHV

  CONTADOR=$(($CONTADOR + 1))
done < "tokens_aux.input"

for file in extra_*.input; do
  UNIQUE=$(echo 00000$CONTADOR | tail -c 4)
  ENTRADATEST="entrada_$UNIQUE"
  ENTRADA="$DIR/$ENTRADATEST"
  TESH="$DIR/aval_$UNIQUE.tesh"
  TESHV="$DIR/valg_$UNIQUE.tesh"

  #define input
  cat $file | sed "/^INF47/d" > $ENTRADA

  #generate tesh
  echo "#! ./tesh" > $TESH
  echo "! timeout 5" >> $TESH
  echo "$ ./main tests/e1/$ENTRADATEST" >> $TESH
  cat $file | grep INF47 | sed -e "s/INF47:/>/" -e "/INF47TABLE:/d" >> $TESH
  echo "! setenv INF47_TABLE=True" >> $TESH
  echo "$ ./main tests/e1/$ENTRADATEST" >> $TESH
  cat $file | grep INF47TABLE: | sed -e "s/INF47TABLE:/>/" >> $TESH

  #generate tesh for valgrind
  echo "#! ./tesh" > $TESHV
  echo "! timeout 15" >> $TESHV
  echo "! output ignore" >> $TESHV
  echo "$ ./tests/scripts/valgrindtest ./main tests/e1/$ENTRADATEST" >> $TESHV

  CONTADOR=$(($CONTADOR + 1))
done

echo "$(($CONTADOR)) testes gerados."

#+end_src

#+RESULTS:
: 77 testes gerados.

